
/* ======================食材模块====================== */
/* 1.食材季节 */
USE tegin_hp;
INSERT INTO hp_foods_season VALUES(DEFAULT,'春季'),(DEFAULT,'夏季'),(DEFAULT,'秋季'),(DEFAULT,'冬季');

/* 2.食材类型
蔬菜类
水果/干果
禽畜/肉类
水产/海鲜
米面豆乳
药食/药材
蛋奶/其它
调味品*/
USE tegin_hp;
INSERT INTO  hp_foods_type VALUES
(DEFAULT,'蔬菜类',NULL),
(DEFAULT,'水果/干果',NULL),
(DEFAULT,'禽畜/肉类',NULL),
(DEFAULT,'水产/海鲜',NULL),
(DEFAULT,'米面/豆乳',NULL),
(DEFAULT,'药食/药材',NULL),
(DEFAULT,'蛋奶/其它',NULL),
(DEFAULT,'调味品',NULL);

/* 3.食材详情表  【添加一些主表id时 首先保证主表有对应数据并且找到对应的id再添加，不能随意添加引用的id】
 急需补充！！！！！！！*/
USE tegin_hp;
DELETE FROM hp_foods;
INSERT INTO hp_foods(fid,ftype_id, fseason_id,fefficiency_desc,fnutrient_name,fcrowd_desc,fno_crowd_desc,f_name) VALUES(
DEFAULT,"6","3","健脾益胃,聪耳明目,食欲不振,脾胃虚弱,皮肤赤肿,肥胖病症","蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,硒,"，"一般人群均可,尤其适合于【手脚冰凉】的女性、【老胃病】复发的患者、易患【感冒】的老人、【消化不良、男女肾亏】等人群。","山药有收涩的作用,因而【大便燥结】者不宜食用。","山药"),
(DEFAULT,6,null,"增强体质,杀菌,抗炎,湿润美容,健胃下泄,强心活血,解毒,抗肿瘤,抗衰老,镇痛,镇静,防臭,防虫,防腐,防晒","热量"，"一般人群均可使用。尤适宜【便秘、皮肤炎、支气管炎】患者。","【肠胃敏感,肾脏疾病患者、妊娠妇女】忌食","芦荟"),
(DEFAULT,6,null,"明目,增强免疫力,降三高,促进胃肠蠕","蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰,","一般人群均可食用。适宜【肝肾阴虚、癌症、高血压、高血脂、动脉硬化、慢性肝炎、脂肪肝】患者食用；【用眼过度、老人】更加适合。","【外邪实热,脾虚有湿、泄泻者】忌服。","枸杞子"),
(DEFAULT,6,null,"养肾补肾,养肝护肝,补血养血,提高免疫力力",null,"一般人均可食用,【遗精阳痿、不育不孕、月经不调】更易食用。","【脾胃虚弱,气滞痰多,腹满便溏】者忌服。","熟地"),
（DEFAULT,6,null,"补血养血,补气益气,止痛镇痛",null,"一般人群均可食用。适用于【肝肾阴亏、须发早白、血虚头晕、腰膝酸软、筋骨酸痛、遗精、崩带、久痢、慢性肝炎】患者更易食用。","【大便溏泻、有湿痰】者慎服。","何首乌"),
（DEFAULT,6,null,"抗衰老,保肝护脏,防治心血管疾病","蛋白质,脂肪,碳水化合物,维生素E,钙,磷,钾,钠,锌,硒,锰","一般人群均可食用。尤适宜【肺结核咳嗽、老人虚弱哮喘者；妇女体虚白带多,中老年人遗精白浊,小便频数,小儿遗尿】者。","五岁以下【小儿、有实邪者】不可服用。白果有小毒,不宜多食常食。","白果"),
(DEFAULT,6,"3","润肺止咳,宁心安神,美容养颜,防癌抗癌","蛋白质,碳水化合物,膳食纤维,烟酸,维生素C,钙,磷,钾,钠,镁,铁","适宜【哮喘、肺燥】者。","【风寒咳嗽、脾虚便溏】忌食。","百合"),
(DEFAULT,6,null,"增强抵抗力,降血压,补中益气,养血,防治胃溃疡","脂肪,碳水化合物","适宜【体质虚弱,气血不足,面色萎黄、病后产后体虚】者；【脾胃气虚,神疲倦怠,四肢乏力,食少便溏,慢性腹泻,肺气不足,咳嗽气促,气虚体弱,易于感冒】；【气虚血亏者、慢性肾炎蛋白尿、慢性贫血、萎黄病、白血病、血小板减少性紫癜、佝偻病】患者。","【气滞、肝火盛】者禁用；【邪盛而正不虚】者不宜用。","党参"),
(DEFAULT,6,null,"补脾止泄,防癌抗癌,防止衰老","蛋白质,热量,碳水化合物,烟酸,维生素C,钙,磷","一般人群均可食用,【遗尿尿频、脾虚久泻】患者易食用。","【产妇】忌食。","芡实"),
(DEFAULT,6,null,"补阳壮阳,调理肠胃,提高免疫力力,止咳,养颜,抗衰老","热量","适宜【脾胃虚弱,体倦乏力,口干食少,肺虚燥咳,精血不足,内热消渴】等人群。","【中寒泄泻,痰湿痞满气滞】者忌服。","黄精"),
(DEFAULT,6,null,"养肝护肝,提高免疫力力,增强记忆力,防癌抗癌,安神镇定,开胃消食,降血糖,止咳,抗衰老,促进睡眠","蛋白质,热量,碳水化合物,膳食纤维","一般人群皆可食用灵芝。【虚劳、咳嗽、气喘、失眠、消化不良、恶性肿瘤】患者更宜食用。","【幼儿,手术前、后一周内、大出血、痛风、服用凝血剂病人】不宜食用灵芝。","灵芝"),
(DEFAULT,6,null,"补血养血,滋阴补阴","热量","【贫血患者、女性、亚健康、体力脑力过劳者、老年人】都可以服用阿胶。","凡【脾胃虚弱、呕吐泄泻、腹胀便溏、咳嗽痰多】者慎用阿胶。","阿胶"),
(DEFAULT,6,null,"健脾养脾,养胃健胃,补气益气,调理肠胃,增强记忆力,滋阴补阴","烟酸,锌,铜","一般人群均可食用荷叶。需要【减肥】的人群更易食用。","【空腹服用】荷叶茶,会使【胃酸】猛增,对胃黏膜造成不良刺激,使胃发胀满、泛酸,若在空腹时食用会增强饥饿感并加重原有的【胃痛】","荷叶"),
(DEFAULT,6,null,"养肝护肝,安神镇定,排毒解毒,清热","蛋白质,热量,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰","一般人均可服用菊花。特别经常【上火】的人群。","【气虚胃寒、食少泄泻】者慎服菊花。","菊花"),
(DEFAULT,6,null,"养肾补肾,补阳壮阳,滋阴补阴,安神镇定,明目,止呕止吐",null,"一般人群均可食用。尤适宜【体质虚弱、气血不足、气短、贫血、神经衰弱】者","【实证、热证而正气不虚】者忌服。【藜芦、五灵脂、皂荚】过敏,应忌同用。"."人参"),
(DEFAULT,6,null,"补气益气,祛湿,消除水肿","蛋白质,热量,膳食纤维","黄芪最适合【气虚脾湿】型的人。","【腹胀、风热咳嗽、感冒、表实邪盛、气滞湿阻、食积停滞、痈疽初起、溃后热毒】尚盛等,【阴虚阳亢】者忌食。","黄芪")
(DEFAULT,6,null,"养肾补肾,滋阴补阴,清肺润肺","蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,维生素B2,维生素C,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰","冬虫夏草适宜【慢性支气管、肺气肿、肺结核、支气管哮喘】患者,【盗汗者、阳痿、遗精】者。","有【表实邪盛】者慎服冬虫夏草。","冬虫夏草"),
(DEFAULT,6,null,"【健脾养脾,养胃健胃】","蛋白质,热量,碳水化合物,膳食纤维","【脾气虚弱,胃阴不足,食少体倦,烦热口渴】者；【肺虚燥咳,咽干痰粘】者；【气阴不足,心悸失眠】者。,","【表实邪盛】者忌食。","太子参"),
(DEFAULT,6,null,"养胃健胃,补气益气,调理肠胃,滋阴补阴,清肺润肺,治疗便秘","热量","一般人群均可食用。【心烦口渴、心阴不足、失眠】患者更易食用。","【风寒咳嗽、感冒、腹泻、胃寒腹痛】病人忌用。","麦冬"),
(DEFAULT,6,null,"补血养血,调理肠胃,增强记忆力,滋阴补阴,清肺润肺,开胃消食,清热止咳","蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,钙,磷","沙参普遍适宜食用,特别适合【肺燥阴虚,干咳痰少,咽干鼻燥】者","【风寒咳嗽、中寒便溏】者禁服；【痰热咳嗽】者慎服。","沙参"),
(DEFAULT,6,null,"养胃健胃,滋阴补阴,清肺润肺","蛋白质,热量,脂肪,碳水化合物,膳食纤维","适宜【体质虚弱、免疫力降低、阴虚燥热、食欲不振、肥胖】的人。","【脾虚便溏】者慎服,【痰湿内蕴】者禁服。","玉竹"),
(DEFAULT,6,null,"养胃健胃,补气益气,防癌抗癌,开胃消食",null,"【阴虚胃痛】者适宜食用","【中阳衰微、胃有寒湿】者忌服。","西洋参"),
(DEFAULT,6,null,"健脾养脾,养胃健胃,滋阴补阴,除皱","钙,钾,镁,铁,锌,铜","一般人群均可食用。【老人、体质虚弱、产后、哺乳期妇女、女士】更宜。","【儿童】慎食；【肺胃虚寒、腹泻患者】不宜服用；【湿热】者不宜多用。","燕窝"),
(DEFAULT,6,null,"补阳壮阳,止痛镇痛","蛋白质,脂肪,碳水化合物,膳食纤维,维生素E,钙,磷,钾,钠,硒,铜,锰","适宜平素【畏寒怕冷,四肢手脚发凉、胃寒冷痛、食欲不振、呕吐清水、腹部隐痛喜暖、肠鸣泄泻】者食用；妇女【产后腹痛、月经期间小腹发凉冷痛、寒性闭经】者；【腰膝冷痛,风寒湿性关节炎】者；【外科阴疽流注、慢性溃疡】久不收口者。","肉桂是温热性药物,如有【口渴、咽干舌燥、咽喉肿痛、鼻子出血等热性症状、急性炎症】时,均不宜服用。患有【干燥综合征、红斑狼疮、糖尿病、癌症、结核病、更年期综合征、慢性肝病、出血性疾病、大便干燥、痔疮、目赤】者忌食。","肉桂"),
(DEFAULT,6,null,"强心,抗炎,抗菌,抗应激,抗氧化,降血脂","脂肪","【头晕目眩,耳鸣耳聋,腰膝酸软,骨蒸潮热】者易食用。","【命门火炽,肝阳上亢、湿热、小便不利】者禁服。","茱萸肉"),
(DEFAULT,6,null,"养胃健胃,补气益气,驱寒,减肥","蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒","一般人群均可食用,尤适宜【痉挛疼痛、白细胞减少症】患者。","【阴虚火旺】者忌食。","茴香"),
(DEFAULT,6,null,"理气血,逐寒湿,止血,安胎","蛋白质,碳水化合物","一般人群均可食用,【月经不调】女性更易食用。","【阴虚血热】者慎用。","艾叶"),
(DEFAULT,6,null,"健脾养脾,养胃健胃,补气益气,防癌抗癌,清肺润肺,消暑解暑","脂肪,碳水化合物,膳食纤维,维生素C","一般人群均可食用柴胡。有【肺部不适】的患者更易食用。","【肝阳上亢,肝风内动,阴虚火旺、气机上逆】者忌用或慎用柴胡。","柴胡"),
(DEFAULT,6,null,"理气解郁,补血养血,调经止痛","热量","一般人均可食用。特别是【女性】朋友","【气虚无滞】者慎服；【阴虚、血热】者禁服","香附"),
(DEFAULT,6,null,"补血养血,补气益气,排毒解毒,清热,止痛镇痛","蛋白质,碳水化合物,膳食纤维","一般人群均可食用郁金。特别是【气血不足】患者。","【气血虚而无瘀滞者、阴虚失血者】禁服,【孕妇】慎服郁金。","郁金"),
(DEFAULT,6,null,"补气益气,增强记忆力,降血压,消除水肿","蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,硒","适宜郁结之【胁痛、胸闷、肝胃不和、脾胃气滞之脘腹胀痛、暖气、恶心】；【久咳痰多】症状的患者。","阴虚有火、无气滞】症状者慎服。","佛手"),
(DEFAULT,6,null,"安神解郁,活血消痈","热量","一般人均可食用特别是【失眠】的人群。","【喉部不适】的患者不宜食用。","合欢皮"),
(DEFAULT,6,null,"健脾养脾,治疗便秘,开胃消食,降血脂,止呕止吐,抗衰老","蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰","一般人均适合食用陈皮。陈皮适宜脾胃气滞、脘腹胀满、消化不良、食欲不振、咳嗽多痰之人食用。预防高血压、心肌梗死、脂肪肝之人、急性乳腺炎者也适合食用陈皮。","【阴津亏损、内有实热者、儿童】慎食。","陈皮"),
(DEFAULT,6,null,"健脾养脾,养胃健胃,补气益气,止泻","蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰","一般人均可食用砂仁。【胃部不适】人群更易食用。","【阴虚血燥、火热内炽】者慎服。","砂仁"),
(DEFAULT,6,null,"补血养血,调理肠胃,开胃消食,美白,养颜","维生素E,铁,锌,硒","一般人均适合食用玫瑰花。特别是【女性】朋友们。","一般人皆可食用,无禁忌人群。","玫瑰花"),
(DEFAULT,6,null,"补血养血,安神镇定,治疗便秘","蛋白质,热量,碳水化合物","一般人均可食用当归。适宜【月经不调、闭经痛经、气血不足、头痛头晕、便秘】者食用。","【慢性腹泻、大便溏泄】不宜食用当归。【热盛出血】者禁服,【湿盛中满、大便溏泄、孕妇】慎服当归。","当归"),
(DEFAULT,6,null,"治便秘,调经,止血","热量,脂肪,碳水化合物,膳食纤维,胡萝卜素,磷","一般人群均可食用桃仁。尤其是【高血糖,糖尿病】患者。","【孕妇】忌食桃仁。","桃仁"),
(DEFAULT,6,null,"补血养血,止痛镇痛","蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰","一般人均可服用红花。特别是对于扭伤患者。","孕妇及月经过多者慎服红花。","红花"),
(DEFAULT,6,null,"祛风,止痛镇痛","蛋白质,热量,脂肪","一般人均可食用川芎。特别是【女性】朋友们。","凡【阴虚阳亢、肝阳上亢】者不宜应用；【月经过多、孕妇】亦忌用川芎。","川芎"),
(DEFAULT,6,null,"补血养血,安神镇定,止泻,消除水肿,养颜,抗衰老","热量","一般人群均可食用益母草。【月经不调】患者更易食用。","【阴虚血少、月经过多、寒滑泻利】者禁服益母草；【孕妇】忌食益母草。","益母草"),
(DEFAULT,6,null,"养肝护肝,补血养血,补气益气,调理肠胃,增强记忆力,开胃消食,降血脂,抗衰老","热量","适宜【月经不调,经闭,痛经,产后(产后食品)瘀痛,癥瘕积聚,胸腹刺痛,风湿痹痛,疮疡痈肿,热病神志昏迷,心悸失眠】；【肝硬化,冠心病】患者。","【月经过多】而无瘀血者禁服,【孕妇】慎服。","丹参"),
(DEFAULT,6,null,"补血养血,调理肠胃,提高免疫力力,滋阴补阴,排毒解毒,开胃消食,消除水肿,消脂吸脂","维生素A","三七适宜【熬夜】人群服用。","【孕妇、尿频】的人群禁食三七。","三七"),
(DEFAULT,6,null,"活血调经,解毒消肿","热量,碳水化合物","一般人群均可食用,【痛经】患者更易食用。","不宜久服；【脾胃虚寒、孕妇】慎用。","月季花"),
(DEFAULT,6,null,"清热凉血,活血祛瘀","热量,钙,钠","一般人均可食用,【气血瘀滞】患者更易食用。","【血虚无瘀、痈疽已溃】者慎服。"),
(DEFAULT,6,null,"利水渗湿,泄热通淋","蛋白质,热量","一般人均可食用,【水肿胀满、遗精】患者更易食用。","【肾虚、精滑、无湿热者】禁服。","泽泻"),
(DEFAULT,6,null,"健脾养脾,安神镇定,祛湿","蛋白质,热量,碳水化合物,膳食纤维,钙,磷,钾,钠,镁,铁,硒,锰","一般人群均可食用。,用于【脾胃虚弱、食欲不振、大便溏泄、心神不宁、心悸失眠、健忘、脾虚水肿、小便不利、早衰白发】。","【虚寒精滑、气虚下陷】者忌服。","茯苓"),
(DEFAULT,6,null,"凉血止血,清热生津,利尿通淋","热量,碳水化合物","一般人均可食用白茅根。白茅根适宜【急性肾炎,急性肾盂炎,膀胱炎,尿道炎、泌尿系感染者、咯血、鼻出血、小便出血】者食用；【高血压】病人也宜食用；【急性发热】性病人【烦热口渴】者宜食；急性传染性【黄疸肝炎】者宜食；【小儿麻疹】者宜食白茅根。,","【脾胃虚寒、溲多不渴】者忌服白茅根。","白茅根"),
(DEFAULT,6,null,"清心去热,治便秘,养心健脑,降压","蛋白质,脂肪,钙,磷,铁","一般人均可食用,特别是常常【失眠】的人群。","一般人群均可食用","莲心"),
(DEFAULT,6,null,"抗菌,抗病毒,解毒,抗炎,解热","热量,碳水化合物","用于【湿热内蕴、肠胃湿热、呕吐、泻痢】等症病人。","本品大苦大寒,过服久服易伤脾胃,【脾胃虚寒】者忌用。【胃虚呕恶、脾虚泄泻、五更肾泻】均应慎服。【苦燥伤津、阴虚津伤】者慎用。","黄连"),
(DEFAULT,6,"1","祛风,清热解毒,止血,增强免疫力",null,"一般人群均可食用。","【慢性疾病、过敏】患者忌食。","香椿"),
(DEFAULT,6,null,"清热燥湿,泻火解毒,安胎,止血","蛋白质,热量,脂肪,碳水化合物","一般人均易食用,特别是【孕妇】","【脾肺虚热】者忌之。凡【中寒作泄、中寒腹痛、肝肾虚少腹痛,血虚腹痛,脾虚泄泻,肾虚溏泻,脾虚水肿,血枯经闭,气虚小水不利,肺受寒邪喘咳、血虚胎不安、阴虚淋露】禁用。","黄芩"),
(DEFAULT,6,null,"养肾补肾,补阳壮阳,提高免疫力力,增强记忆力,滋阴补阴,开胃消食","蛋白质,热量,脂肪,钙,磷,钾,钠,镁,铁,锌,硒","【失眠、肾虚、阳痿、遗精、腰膝酸软】者食用。","【内有火热】者不宜食用；【儿童未发育、更年期男士、老龄男士】慎食。","牛鞭"),
(DEFAULT,6,null,"健脾养脾,养胃健胃,补气益气,安神镇定,清肺润肺,消暑解暑","蛋白质,脂肪,碳水化合物,膳食纤维,维生素A","一般人群均可食用金银花。特别是【脾胃虚弱】的人群。","【脾胃虚寒】者(如经常【肚子疼、腹泻、腹部发凉、手脚发凉】)不宜食用金银花。","金银花"),
(DEFAULT,6,null,"补血养血,补气益气,调理肠胃,增强记忆力,滋阴补阴,祛湿,排毒解毒,开胃消食,止痛镇痛,养颜,抗衰老",null,"一般人群均可食用防风。特别是对于【阴虚】患者来说。","【湿热】体质的人不适宜食用防风。【血虚痉急、头痛】不因风邪者忌服防风。"),
(DEFAULT,6,null,"健脾养脾,养胃健胃,养肾补肾,补气益气,调理肠胃,提高免疫力力","热量","一般人群均可食用栀子花。特别是【胃部不适】的患者。","【过敏、身体虚弱】的人不能服用栀子花。栀子花苦寒,【脾虚泄泻,肾阳不足】者慎食栀子花。","栀子"),
(DEFAULT,6,null,"降血压,养颜","蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,维生素B2,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰","一般人群均可食用白芷。【高血压】痛患者更易食用。","【气虚血热、阴虚阳亢】者禁服白芷。","白芷"),
(DEFAULT,6,null,"健脾养脾,补气益气,祛湿,消除水肿","蛋白质,热量","【脾胃气虚、不思饮食、倦怠无力、慢性腹泻、消化功能不佳】者宜食；【自汗易汗、老小虚汗、小儿流涎】者。","【阴虚内热、津液亏耗】者慎服；【胃胀腹胀、气滞饱闷】者。","白术"),
(DEFAULT,6,null,"补血养血,调理肠胃,增强记忆力,开胃消食,养颜,抗衰老,减肥","蛋白质
量,脂肪,碳水化合物,膳食纤维,胡萝卜素,维生素E,磷,钾,钠,铁,锌,铜,锰","一般人群均可食用。尤适宜【外感风热,头痛目赤,咽喉肿痛】者宜食；【口疮口臭,牙龈肿痛、风热瘙痒】者。","【阴虚血燥、汗多表虚】者忌食；【脾胃虚寒,腹泻便溏】者切忌多食久食。","薄荷");
