
/* ======================食材模块====================== */
/* 1.食材季节 */
USE tegin_hp;
DELETE FROM hp_foods_season;
INSERT INTO hp_foods_season VALUES(DEFAULT,'春季'),(DEFAULT,'夏季'),(DEFAULT,'秋季'),(DEFAULT,'冬季');

/* 2.食材类型
蔬菜类
水果/干果
禽畜/肉类
水产/海鲜
米面豆乳
药食/药材
蛋奶/其它
调味品*/
USE tegin_hp;
DELETE FROM hp_foods_type;
INSERT INTO  hp_foods_type VALUES
(DEFAULT,'蔬菜类',NULL),
(DEFAULT,'水果/干果',NULL),
(DEFAULT,'禽畜/肉类',NULL),
(DEFAULT,'水产/海鲜',NULL),
(DEFAULT,'米面/豆乳',NULL),
(DEFAULT,'药食/药材',NULL),
(DEFAULT,'蛋奶/其它',NULL),
(DEFAULT,'调味品',NULL);

/* 3.食材详情表  【添加一些主表id时 首先保证主表有对应数据并且找到对应的id再添加，不能随意添加引用的id】
 急需补充！！！！！！！*/
USE tegin_hp;
DELETE FROM hp_foods;
INSERT INTO hp_foods(fid,ftype_id, fseason_id,fefficiency_desc,fnutrient_name,fcrowd_desc,fno_crowd_desc,f_name) VALUES
(DEFAULT,1,'1,2,4','杀菌,促消化,降压降脂,补钙,防癌抗癌,延缓衰老','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,铁,碘,硒','一般人群均可食用。尤适宜【高血压、动脉硬化】等【心血管疾病】患者。','【皮肤瘙痒】性疾病、【眼疾、胃病】患者慎食。','洋葱') ,
(DEFAULT,1,NULL,'促进智力发育,新陈代谢,降血脂,抗疲劳,防过敏','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,磷,钾,钠,镁,铁','一般人群均可食用。适合【气血不足、营养不良的老人、儿童、癌症患者、肝脏病、胃肠道溃疡、心脑血管疾病】患者食用。','【脾胃虚寒、慢性腹泻、关节炎、红斑狼疮】患者慎食。','金针菇') ,
(DEFAULT,1,'2,3','抗菌消炎,利尿,防癌,抗衰老,治疗牙龈出血,缓解眼疲劳','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,磷,钾,钠,镁,铁','一般人群均可食用。尤适宜于【热性病发热、口渴、食欲不振、习惯性牙龈出血、贫血、头晕、心悸、高血压、急慢性肝炎、急慢性肾炎、夜盲症、近视眼】者食用；','【急性肠炎、菌痢、溃疡活动期】病人不宜食用。','西红柿') ,
(DEFAULT,1,NULL,'健脾养脾,养胃健胃,养肾补肾,防癌抗癌,助发育','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒','花菜对【食欲不振、消化不良、大便燥结】者都有帮助；花菜适宜【生长发育】期的【儿童】、生活在污染环境中肝脏易遭到毒害的以及一切希望抵抗【癌症、肿瘤】染身的人们食用。','花菜没有特殊禁忌。','花菜') ,
(DEFAULT,1,NULL,'有助消化,增强食欲,化痰清热,宽中下气,降血脂,降血压等','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,硒','一般人均可食用,尤其适宜消化不良、食欲不振等人群。','【脾胃虚寒、寒性体质】的人群不宜常吃；【胃溃疡、十二指肠溃疡、慢性胃炎、单纯甲状腺肿、先兆流产、子宫脱垂】等患者需忌吃。','白萝卜') ,
(DEFAULT,1,3,'有助消化,增强食欲,化痰清热,宽中下气,降血脂,降血压等','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。【脑力劳动者】更适宜。（过多食用葱会损伤视力。）','【眼疾患者、胃肠道疾病特别是溃疡病】的人,【表虚、多汗】者忌食。有【腋臭】的人在夏季应慎食。','大葱') ,
(DEFAULT,1,'2,3','抗肿瘤,抗衰老,防酒精中毒,降血糖,减肥强体,健脑安神','蛋白质,碳水化合物,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,','一般人群均可食用。尤适宜【热病、肥胖、高血压、高血脂、水肿、癌症、嗜酒者、糖尿病】患者食用。','【脾胃虚弱、腹痛腹泻、肺寒咳嗽、肝病、心血管病、肠胃病】患者慎食。','黄瓜') ,
(DEFAULT,1,'2,3','开通疏利,消积下气,利尿通乳,强壮机体,防癌抗癌,宽肠通便','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,胆碱,钙,磷,钾,钠,镁,铁,硒','一般人均可食用。尤适宜【婴幼儿、乳母】。','【视力弱者、眼疾、夜盲症】患者忌食。','莴笋') ,
(DEFAULT,1,2,'消脂减肥,镇痛催眠,驱寒利尿,抑制病毒','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。尤适宜【失眠、胆固醇高、神经衰弱】的人。','【尿频、胃寒】的人慎食。','生菜') ,
(DEFAULT,2,NULL,'清热解暑,止渴除烦,治疗感冒,预防冠心病','热量,碳水化合物,维生素A,维生素C,钙,磷,钾,钠,镁,硒','一般人皆可食用,适宜于【贫血、便秘、胃病、咳嗽痰喘、肾病】等患者。','哈密瓜性凉,不宜多吃,而患有【脚气病、黄疸、腹胀、产后、病后、糖尿病】患者不宜多食。','哈密瓜') ,
(DEFAULT,2,1,'促进消化,润肺止咳,预防感冒,防止呕吐,减肥','蛋白质,碳水化合物,膳食纤维,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用,尤适宜【肺痿咳嗽、胸闷多痰、劳伤吐血、坏血病】患者。','【脾虚泄泻】者、【糖尿病】患者忌食。','枇杷') ,
(DEFAULT,2,3,'降血压,降胆固醇,消食化积,美容养颜,减肥,防癌抗癌','碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁','一般人都可食用,尤其【便秘、腹泻、前列腺、脾胃虚弱】患者、【高血压、癌症、贫血】患者食用更佳。','【溃疡性结肠炎、白细胞减少症、前列腺肥大者、冠心病、糖尿病、肾病、心肌梗塞、胃寒】等病者慎吃。','苹果') ,
(DEFAULT,2,3,'口渴咽干,食欲不振,消化不良,晕眩呕吐,咽痛音哑,咳嗽痰多,气喘',NULL,'一般人群均能食用,【皮肤病,肿瘤,糖尿病】患者应忌食。','【皮肤病,肿瘤,糖尿病】患者应忌食。','芒果') ,
(DEFAULT,2,'3,4','降血脂,降血糖,促进消化,提高免疫力力,改善夜盲症','蛋白质,热量,碳水化合物,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,硒','一般人群皆可食用,尤其适宜【咳嗽、痰多气喘、慢性支气管炎、消化不良、饮酒过量】者。','柚子性寒,【气虚体弱】者不宜食用；【腹部寒冷、常患腹泻】者宜少食。','柚子') ,
(DEFAULT,2,4,'健脾养脾,补气益气,调理肠胃,提高免疫力力,滋阴补阴,开胃消食,抗衰老','蛋白质,热量,碳水化合物,维生素C,维生素E,钾','一般人群均可食用。【胃痛、久咳不止、咳嗽有痰】患者易食用。','多食易“上火”,从而促发口腔炎,牙周炎等症；【肠胃功能不佳】者多吃易发生胃粪石的困扰；【风寒咳嗽、痰饮咳嗽】者不宜食用。','橘子') ,
(DEFAULT,2,4,'健脾养脾,补血养血,补气益气,调理肠胃,增强记忆力,滋阴补阴,消暑解暑,排毒解毒,开胃消食,清热,止渴,养颜,抗衰老','碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,硒','一般人群均可以食用甘蔗。特别是【便秘】患者。','【糖尿病】患者忌食。【脾胃虚寒、胃腹寒疼】者不宜食用。','甘蔗') ,
(DEFAULT,3,NULL,'补充蛋白质,脂肪酸,补肾滋阴,润燥','蛋白质,脂肪,碳水化合物,烟酸,维生素A,维生素C,维生素E,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','一般人都可食用。适宜【阴虚不足、头晕、贫血、老人燥咳无痰、大便燥结、营养不良】者食用。','【糖尿病】患者忌食。【脾胃虚寒、胃腹寒疼】者不宜食用。','猪肉') ,
(DEFAULT,3,NULL,'养肾,补肾,补阳,壮阳','蛋白质,脂肪,碳水化合物,烟酸,维生素A,维生素B2,维生素C,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒,铜','一般人群均可食用。适宜【肾虚之人腰酸腰痛、遗精、盗汗】者食用；适宜【老年人肾虚耳聋、耳鸣】者食用。','【血脂偏高、高胆固醇】者忌食。','猪腰') ,
(DEFAULT,3,NULL,'补充蛋白质,补中益气','蛋白质,热量,脂肪,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素E,胆固醇,钙,磷,钾,钠,镁,铁,锌,碘,硒,铜,锰','一般人群均可食用。适宜于【生长发育、术后、病后调养】的人、【中气不足、气短体虚、筋骨酸软、贫血久病、面黄目眩】之人食用。','【感染性疾病、肝病、肾病】的人慎食;黄牛肉为发物,患【疮疥、湿疹、痘痧、瘙痒、高胆固醇、高脂肪、老年人、儿童、消化不良】的人不宜多吃。','牛排') ,
(DEFAULT,4,NULL,'对抗疾病,通乳汁,明目益智,美容抗皱','蛋白质,热量,脂肪,碳水化合物,烟酸,维生素A,维生素E,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','【慢性肾炎水肿、肝硬化腹水、营养不良性浮肿、孕妇产、脾胃虚弱、小儿麻疹初期、痔疮出血、慢性久痢】者食用。','【感冒发热】者不宜多吃。','鲫鱼') ,
(DEFAULT,4,NULL,'对补气血,益脾健胃','蛋白质,热量,脂肪,烟酸,胡萝卜素,维生素A,维生素E,胆固醇,钙,磷,钾,钠,镁,铁,锌,碘','一般人群均可食用。尤适宜【体质虚弱,虚劳赢瘦,脾胃气虚、饮食不香,营养不良】之人,【老幼、妇女、脾胃虚弱】者。','有【哮喘、咯血】的病人,【寒湿】盛者不宜食用。','鳜鱼') ,
(DEFAULT,5,NULL,'具有益中气,止泻痢,利小便,消痈肿功效,还可治脾胃不适,呃逆呕吐,心腹胀痛,口渴泻痢等病症','蛋白质,热量,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,锰','一般人群均可,尤其适合【脱肛、慢性腹泻、子宫脱垂】等【中气不足】患者宜食。','由于豌豆多吃会腹胀,易产气,因而【尿路结石、皮肤病、慢性胰腺炎】患者不宜食用；此外,【糖尿病、消化不良】者也要慎食。','豌豆') ,
(DEFAULT,5,NULL,'降血糖,润肠通便,补充钙质,延年益寿,美白祛斑,预防心血管疾病','蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,维生素A,维生素E,叶酸,生物素,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。尤适宜【便秘、糖尿病、脂肪肝、高血压、高血脂、动脉硬化】患者。','【肠道敏感】人慎食。','燕麦') ,
(DEFAULT,6,NULL,'健脾益胃,聪耳明目,食欲不振,脾胃虚弱,皮肤赤肿,肥胖病症','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,硒','一般人群均可,尤其适合于【手脚冰凉】的女性、【老胃病】复发的患者、易患【感冒】的老人、【消化不良、男女肾亏】等人群。','山药有收涩的作用,因而【大便燥结】者不宜食用。','山药') ,
(DEFAULT,6,NULL,'润肺止咳,宁心安神,美容养颜,防癌抗癌','蛋白质,碳水化合物,膳食纤维,烟酸,维生素C,钙,磷,钾,钠,镁,铁','适宜【哮喘、肺燥】者。','【风寒咳嗽、脾虚便溏】忌食。','百合') ,
(DEFAULT,7,NULL,'抗癌,防辐射,抗菌,美容护肤,醒脑提神,利尿解乏,解疲劳,护齿明目,降脂助消化','蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,铜,锰','一般人均可饮用。尤适宜【高血压、高血脂、冠心病、动脉硬化、糖尿病、食用油腻过多、醉酒】者；【长期吸烟、饮酒过量】,【发热口渴、头痛目昏、小便不利、食用奶类过多】者。','【发烧、肝脏病人、尿结石患者、孕妇、哺乳期、经期女性】忌食；【老年人】忌饮生茶。','绿茶') ,
(DEFAULT,8,NULL,'调理肠胃,提高免疫力,排毒解毒,开胃消食,降血压,燃烧脂肪,减肥','热量,磷,钾','一般人群均可食用米醋，能起到一定的减肥作用。','正在服用某些西药者、胃溃疡和胃酸过多患者、老年人在骨折治疗和康复綦江应避免吃米醋。','米醋') ;
 /* 4.食材搭配表 需要补充数据！！！！*/
/*USE tegin_hp;
DELETE FROM hp_foods_collocation;
INSERT INTO hp_foods_collocation VALUES
(DEFAULT,1,2,1,'洋葱和苹果一起吃；可以保护心脏'),
(DEFAULT,1,3,1,'洋葱和苦瓜一起吃；可以提高免疫力'),
(DEFAULT,1,4,1,'洋葱和猪肝一起吃；可以增强免疫'),
(DEFAULT,1,5,1,'洋葱和羊肉一起吃；可以降低胆固醇'),
(DEFAULT,1,6,0,'洋葱不能和蜂蜜一起吃；会伤害眼睛'),
(DEFAULT,1,7,0,'洋葱不能和黄豆一起吃；会降低钙吸收'),
(DEFAULT,1,8,0,'洋葱不能和黄鱼一起吃；会降低蛋白质吸收、形成结石'); */

