USE tegin_hp;
DELETE FROM hp_foods;
INSERT INTO hp_foods(fid,ftype_id, fseason_id,fefficiency_desc,fnutrient_name,fcrowd_desc,fno_crowd_desc,f_name) VALUES
(DEFAULT,3,NULL,'明目,补血,排毒,提高免疫力','蛋白质,热量,脂肪,碳水化合物,烟酸,维生素A,维生素C,维生素E,叶酸,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒,铜','一般人群均可食用。更适宜【气血虚弱、面色萎黄、缺铁性贫血、视力模糊、夜盲、眼干燥症、小儿麻疹病后角膜软化症、内外翳障】等【眼病】者食用。','【高胆固醇、肝病】患者忌食。','猪肝') ,
(DEFAULT,3,NULL,'补充蛋白质,脂肪酸,补肾滋阴,润燥','蛋白质,脂肪,碳水化合物,烟酸,维生素A,维生素C,维生素E,叶酸,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','一般人都可食用。适宜【阴虚不足、头晕、贫血、老人燥咳无痰、大便燥结、营养不良】者食用。','【湿热痰滞、外感病人】忌食；【肥胖、高血脂、高血压】者慎食。','猪肉') ,
(DEFAULT,3,NULL,'补脾,润肠,生津,补中益气,养血,健骨','蛋白质,脂肪,碳水化合物,烟酸,维生素A,维生素C,维生素E,叶酸,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。更适宜【中老年人、青少年】。,','【【感冒发热】期间忌食,【急性肠道炎】感染者忌食；【骨折初期】(1～2周)不宜饮用排骨汤,中期可少量进食,后期饮用可达到很好的食疗效果。','猪骨') ,
(DEFAULT,3,NULL,'强身健体,提高免疫力力,补肾精,促进智力发育',NULL,'一般人群均可食用。【老人、病人、体质虚弱】者更宜食用。','【口腔溃疡、皮肤疖肿、大便燥结、感冒发热、内火偏旺、痰湿偏重、肥胖症、热毒疖肿、高血压、胆囊炎、胆石症、动脉硬化、冠心病、高血脂】、服用铁制剂时不宜食用、【尿毒症】患者应禁食。','鸡肉') ,
(DEFAULT,3,NULL,'长肌肉,提高免疫力力,补铁补血,抗衰老','蛋白质,脂肪,烟酸,维生素A,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。适宜于【生长发育、术后、病后调养】的人、【中气不足、气短体虚、筋骨酸软、贫血、面黄目眩】之人食用。','【感染性疾病、肝病、肾病、疮疥湿疹、痘痧、瘙痒、高胆固醇、高脂肪、老年人、儿童、消化力弱】的人不宜多吃。','牛肉') ,
(DEFAULT,3,NULL,'益气补虚,滋阴',NULL,'一般人群均可食用。适宜【癌症患者、放疗化疗、糖尿病,肝硬化腹水,肺结核,慢性肾炎浮肿】者食用。','【素体虚寒】,受凉引起的不思饮食,【胃部冷痛、大便溏泄、腰痛、寒性痛经、肥胖、动脉硬化、慢性肠炎】应少食；【感冒】患者不宜食用。','鸭肉') ,
(DEFAULT,3,NULL,'补血养血,补气益气,排毒解毒',NULL,'特别适合【肾虚体弱、心神不宁、儿童成长、体力透支】者食用乳鸽。','【怀孕中期、发烧、燥热】的人不宜吃乳鸽','鸽肉') ,
(DEFAULT,3,NULL,'治疾病,健脑,防过敏,防失眠',NULL,'一般人群均可食用。适宜【婴幼儿、孕产妇、老人、病人、身体虚弱、体质虚弱,营养不良,气血不足、肺气虚弱、支气管哮喘、肺结核、神经衰弱、胃气不足、胃病、心血管病】患者易食。','【脑血管病】人不宜多食。','鹌鹑') ,
(DEFAULT,3,NULL,'健脾养脾,养肝护肝,补血养血,补气益气,调理肠胃,提高免疫力力','蛋白质,碳水化合物,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。尤适宜【贫血、老人、妇女、从事粉尘、纺织、环卫、采掘等工作】的人；【血虚、头风眩晕、肠道寄生虫病人、腹胀】嘈杂者。','【高胆固醇血症、肝病、高血压、冠心病】患者慎食；凡有病期间、患有【上消化道出血】阶段忌食。','猪血') ,
(DEFAULT,3,NULL,'养肾,补肾,补阳,壮阳','蛋白质,脂肪,碳水化合物,烟酸,维生素A,维生素B2,维生素C,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒,铜','一般人群均可食用。适宜【肾虚之人腰酸腰痛、遗精、盗汗】者食用；适宜【老年人肾虚耳聋、耳鸣】者食用。','【血脂偏高、高胆固醇】者忌食。','猪腰') ,
(DEFAULT,3,NULL,'健脾健胃,补气,补虚','蛋白质,热量,脂肪,碳水化合物,烟酸,维生素A,叶酸,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。【虚劳瘦弱者、脾胃虚弱,食欲不振,泄泻下痢者、中气不足,气虚下陷,男子遗精,女子带下、体虚、小便颇多者、小儿疳积】者宜食用。','【高血脂】患者忌食。','猪肚') ,
(DEFAULT,3,NULL,'补脾补胃,补肝补肾,补血温经,保护胃黏膜,补肝明目',NULL,'一般人群均可食用。适宜【体虚胃寒】者。','【发热、牙痛、口舌生疮、咳吐黄痰、上火症状】者不宜食用；【肝病、高血压、急性肠炎、其他感染性疾病、发热】期间不宜食用。','羊肉') ,
(DEFAULT,3,NULL,'健脑益智,活血,美容,保健',NULL,'一般人群均可食用。尤适宜【老人、妇女、肥胖者、肝病、心血管病、糖尿病】患者。','【孕妇、经期女性、明显阳虚症状的女子、脾胃虚寒者】忌食。','兔肉') ,
(DEFAULT,3,NULL,'延缓衰老,补肝补肾,养血益精,健脾固冲','蛋白质,热量,脂肪,烟酸,维生素E,胆固醇,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。尤适宜【体虚血亏、肝肾不足、脾胃虚弱】的人易食用。','无不适宜人群。','乌鸡') ,
(DEFAULT,3,NULL,'提高免疫力力,驱寒',NULL,'一般人群均可食用狗肉。狗肉尤适宜【腰膝冷痛、小便清长、小便频数、浮肿、耳聋、阳痿、脘腹胀满、腹部冷痛】者食用。','凡患【咳嗽、感冒、发热,大病初愈】的人也不宜食用狗肉。','狗肉') ,