
/* ======================食材模块====================== */
/* 1.食材季节 */
USE tegin_hp;
DELETE FROM hp_foods_season;
INSERT INTO hp_foods_season VALUES(DEFAULT,'春季'),(DEFAULT,'夏季'),(DEFAULT,'秋季'),(DEFAULT,'冬季');

/* 2.食材类型
蔬菜类
水果/干果
禽畜/肉类
水产/海鲜
米面豆乳
药食/药材
蛋奶/其它
调味品*/
USE tegin_hp;
DELETE FROM hp_foods_type;
INSERT INTO  hp_foods_type VALUES
(DEFAULT,'蔬菜类',NULL),
(DEFAULT,'水果/干果',NULL),
(DEFAULT,'禽畜/肉类',NULL),
(DEFAULT,'水产/海鲜',NULL),
(DEFAULT,'米面/豆乳',NULL),
(DEFAULT,'药食/药材',NULL),
(DEFAULT,'蛋奶/其它',NULL),
(DEFAULT,'调味品',NULL);

/* 3.食材详情表  【添加一些主表id时 首先保证主表有对应数据并且找到对应的id再添加，不能随意添加引用的id】
 急需补充！！！！！！！*/
USE tegin_hp;
INSERT INTO hp_foods(fid,ftype_id, fseason_id,fefficiency_desc,fnutrient_name,fcrowd_desc,fno_crowd_desc,f_name)
VALUES
(DEFAULT,1,'1,2,4','杀菌,促消化,降压降脂,补钙,防癌抗癌,延缓衰老','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,铁,碘,硒','一般人群均可食用。尤适宜【高血压、动脉硬化】等【心血管疾病】患者。','【皮肤瘙痒】性疾病、【眼疾、胃病】患者慎食。','洋葱'),
(DEFAULT,1,'3,4','健脾开胃,清热解毒,降气止咳,降血糖,降血脂,补肝明目,美容护肤','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人皆可食用。尤以【癌症、高血压、夜盲症、干眼症、营养不良、皮肤粗糙】者为最。','【饮酒过量】者不宜食用','胡萝卜'),
(DEFAULT,1,NULL,'促进智力发育,新陈代谢,降血脂,抗疲劳,防过敏','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,磷,钾,钠,镁,铁','一般人群均可食用。适合【气血不足、营养不良的老人、儿童、癌症患者、肝脏病、胃肠道溃疡、心脑血管疾病】患者食用。','【脾胃虚寒、慢性腹泻、关节炎、红斑狼疮】患者慎食。','金针菇'),
(DEFAULT,1,'2,3','抗菌消炎,利尿,防癌,抗衰老,治疗牙龈出血,缓解眼疲劳','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,磷,钾,钠,镁,铁','一般人群均可食用。尤适宜于【热性病发热、口渴、食欲不振、习惯性牙龈出血、贫血、头晕、心悸、高血压、急慢性肝炎、急慢性肾炎、夜盲症、近视眼】者食用；','【急性肠炎、菌痢、溃疡活动期】病人不宜食用。','西红柿'),
(DEFAULT,1,NULL,'健脾养脾,养胃健胃,养肾补肾,防癌抗癌,助发育','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒','花菜对【食欲不振、消化不良、大便燥结】者都有帮助；花菜适宜【生长发育】期的【儿童】、生活在污染环境中肝脏易遭到毒害的以及一切希望抵抗【癌症、肿瘤】染身的人们食用。','花菜没有特殊禁忌。','花菜'),
(DEFAULT,1,NULL,'有助消化,增强食欲,化痰清热,宽中下气,降血脂,降血压等','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,硒','一般人均可食用,尤其适宜消化不良、食欲不振等人群。','【脾胃虚寒、寒性体质】的人群不宜常吃；【胃溃疡、十二指肠溃疡、慢性胃炎、单纯甲状腺肿、先兆流产、子宫脱垂】等患者需忌吃。','白萝卜'),
(DEFAULT,1,'2,3','抗肿瘤,抗衰老,防酒精中毒,降血糖,减肥强体,健脑安神','蛋白质,碳水化合物,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,','一般人群均可食用。尤适宜【热病、肥胖、高血压、高血脂、水肿、癌症、嗜酒者、糖尿病】患者食用。','【脾胃虚弱、腹痛腹泻、肺寒咳嗽、肝病、心血管病、肠胃病】患者慎食。','黄瓜') ,
(DEFAULT,1,3,'有助消化,增强食欲,化痰清热,宽中下气,降血脂,降血压等','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。【脑力劳动者】更适宜。（过多食用葱会损伤视力。）','【眼疾患者、胃肠道疾病特别是溃疡病】的人,【表虚、多汗】者忌食。有【腋臭】的人在夏季应慎食。','大葱') ,
(DEFAULT,1,'2,3','开通疏利,消积下气,利尿通乳,强壮机体,防癌抗癌,宽肠通便','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,胆碱,钙,磷,钾,钠,镁,铁,硒','一般人均可食用。尤适宜【婴幼儿、乳母】。','【视力弱者、眼疾、夜盲症】患者忌食。','莴笋') ,
(DEFAULT,1,2,'消脂减肥,镇痛催眠,驱寒利尿,抑制病毒','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。尤适宜【失眠、胆固醇高、神经衰弱】的人。','【尿频、胃寒】的人慎食。','生菜') ,
(DEFAULT,1,2,'健脾养胃,护肝补肾,消炎止痛,润肺益气,驱虫解毒','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁','一般人均可食用,尤其适合【脾虚弱、营养不良、肺痈、支气管哮喘、老年慢性支气管炎、糖尿病、前列腺炎、水火烫伤】等患者食用。','南瓜性温,【胃热、温热气滞】的人少吃南瓜,同时有【脚气、黄痘、气滞湿阻】病的人最好也不要食用,另外患有感染性疾病和【发热】症状者不宜食用。','南瓜')，
(DEFAULT,1,'3,4','通利肠胃,清热解毒,止咳化痰,利尿养胃,促进生长发育','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钠,镁,铁','一般人均可食用,尤其适合【感冒发热、肺热咳嗽、便秘、咽喉发炎】者。','大白菜性寒,【胃寒腹痛、大便溏泻、寒痢疾】者不可多食。','白菜'),
(DEFAULT,1,NULL,'和胃活血,消肿等功效,可辅助治疗消化不良,习惯性便秘,神经乏力','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,叶酸,钙,磷,钾,钠,镁,铁,硒','一般人群均可,尤其适合【胃病、心脏病】患者食用。','处于【妊娠早期】的妇女【胃肠消化功能低下】者不宜食用。','土豆'),
(DEFAULT,1,NULL,'补中益气,益胃宽肠,解毒通便,消肿止痛','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,叶酸,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用,尤其适合【体虚】者','对于有痰、敏性体质【荨麻疹、湿疹、哮喘、过敏性鼻炎】者、【小儿食滞、胃纳欠佳、糖尿病】患者应少食；【食滞胃痛、肠胃湿热】者忌食。','芋头'),
(DEFAULT,1,NULL,'防癌抗癌,减肥瘦身,防动脉硬化','热量,钙,磷,钾,钠,铁,锌,硒,锰','一般人均可使用,尤其适合经常被【便秘】困扰的人。','【腹泻、糖尿病人】不宜吃红薯,有【胃病】的患者也要少吃。','红薯'),
(DEFAULT,1,2,'润肤美白,健脑,活血通络,解毒消肿','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,硒','一般人群均可食用。尤适宜【月经不调、身体疲乏、痰喘咳嗽、产后乳汁不通】的妇女。','【孕妇、体虚内寒、腹泻】者慎食。','丝瓜'),
(DEFAULT,1,NULL,'排毒养颜,美容祛斑','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒','【老幼妇孺、体弱多病】者尤宜,特别适宜【高热病人、吐血者、高血压、肝病、食欲不振、缺铁性贫血、营养不良】者多食用','藕性偏凉,【产妇】不宜过早食用。','莲藕'),
(DEFAULT,1,NULL,'增强免疫力,调理疾病,舒筋活血,延年益寿,促进大脑发育','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。【体弱、更年期妇女、肝炎、消化系统疾病】人群,【软骨病、心血管疾病、尿道结石症、癌症】患者尤其适宜。','食用【菌类过敏】者忌食。','平菇'),
(DEFAULT,1,NULL,'解毒消肿,开胃消食,温中,利气','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,铁,锌,硒,铜','一般人均可食用,老年人宜多食。','雪里红含大量粗纤维,不易消化,小儿【消化功能不全】者不宜多食。','雪里蕻'),
(DEFAULT,1,NULL,'补气血,减肥,防癌,治便秘,清肠胃','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。尤适宜【心脑血管疾病、结石症】患者食用,特别适合【缺铁】的人士、矿工、冶金工人、纺织工、理发师食用。','有【出血性疾病、腹泻者、孕妇】慎食。','木耳菜'),
(DEFAULT,1,NULL,'清热解毒,利湿,滑肠,补脾益气','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,镁,铁,锌','一般人群均可食用,尤适宜【湿疹、肠风热毒】者','【脾胃虚寒、阳虚体质】者慎食；常人也不宜多食。','蕨菜'),
(DEFAULT,1,NULL,'防癌抗癌,增强免疫力,促生长,减肥,清热解渴,抗衰老,护心养心','蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用,【免疫力低下】者宜多食。','【红斑狼疮】患者忌食','西兰花'),
(DEFAULT,1,NULL,'清热解暑,治疗口腔溃疡,防治便秘,减少胆固醇堆积','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,铁','一般人群均可食用。尤适宜【便秘、心血管疾病、消化道癌症】患者。','【脾胃虚寒】者忌食。','绿豆芽'),
(DEFAULT,1,NULL,'清热除火,生津止渴,养阴补虚','蛋白质,热量,碳水化合物,膳食纤维,维生素C,维生素E,钙,磷,钾,钠,镁,铁','【更年期】妇女易多食。','【气郁、特禀、阳虚、瘀血】体质不宜食','凉薯'),
(DEFAULT,1,NULL,'预防心血管疾病,促进新陈代谢,抗老化','蛋白质,热量,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,钙,磷,钠,镁,铁','一般人群均可食用,老年人与【心血管疾病】患者宜多食。','【肝火旺盛】者不宜多食','甜椒'),
(DEFAULT,1,2,'防癌,降脂减肥,美容,防暑解热','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,铁,硒,锰','一般人群均可食用。尤适宜【糖尿病、高血压】患者。','【脾胃虚寒、低血压】患者慎食。','空心菜'),
(DEFAULT,1,'2,3','减肥降脂,护肾,清热化痰,防癌抗癌,美容润肤','碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁','一般人群均可食用。尤适宜【肾病、水肿、脚气病、癌症、糖尿病、冠心病】患者。','【脾胃虚寒、肾脏虚寒、阳虚肢冷】者慎食。','冬瓜'),
(DEFAULT,1,2,'开胃健脾,宽胸利膈,通肠排便,降三高,提高免疫力力','蛋白质,碳水化合物,膳食纤维,烟酸,维生素C,钙,磷,钾,镁,锰','一般人群均可食用。尤适宜【肥胖、习惯性便秘】的人。','【胃溃疡、胃出血、肾炎、肝硬化、肠炎者、尿路结石者、低钙、骨质疏松、佝偻】病人慎食；【儿童】不宜多食。','竹笋'),
(DEFAULT,1,NULL,'改善记忆,降血脂,抗衰老,抗癌防癌,美容养颜','蛋白质,脂肪,碳水化合物,膳食纤维','一般人群均可食用,【血压高女性】宜食用。','所以有【蘑菇过敏】史的人群应特别注意忌食茶树菇','茶树菇'),
(DEFAULT,1,NULL,'防癌抗癌,抗菌消炎,利肠通便,提高免疫力力','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,生物素,钙,磷,钾,钠,镁,铁','一般人群均可食用。尤适宜【糖尿病】患者、【产后乳汁不通】的妇女。','【脾胃虚弱、肾功能不全】者忌食。','荷兰豆'),
(DEFAULT,1,'1,4','健脾养脾,调理肠胃,消暑解暑,降血脂,降血糖,减肥,降低胆固醇','蛋白质,热量,碳水化合物,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,硒,','一般人群均可食用菜心,菜心各类营养成分含量比较均衡全面,热量较低,适宜【减肥】期间食用菜心。','【麻疹、疥疮、目疾】患者不宜食菜心。【婴儿,幼儿,久病体虚】人群忌食菜心。','菜心'),
(DEFAULT,1,2,'养胃健胃,消暑解暑,治便秘,祛湿,排毒解毒,降血脂,降血压,降血糖','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁','茭白适宜【高血压、黄胆肝炎】病人、【产后乳汁不足】的妇女、【饮酒过量、酒精中毒】的患者食用。','患有【心脏病、尿路结石】患者忌食。','茭白'),
(DEFAULT,1,'1,4','补血养血,治便秘,止渴,抗衰老,护心养心','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒,锰,','一般人群均可食用菠菜,【糖尿病、高血压、贫血、坏血病】者适宜。','【肾炎、肾结石、胃肠虚寒、腹泻】者忌食。','菠菜'),
(DEFAULT,1,1,'美肤,养心,通肠,健胃,降血压,利小便','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。尤适宜【高血压患者、脑力劳动人士、贫血者、骨折患者】','【胃虚泄泻】者慎食。','茼蒿'),
(DEFAULT,1,'1,4','防癌抗癌,安神镇定,降血压,抗衰老','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁','一般人均可食用芹菜。适宜【高血压及其并发症患者】食用,【血管硬化、神经衰弱】者也宜多吃芹菜。','【脾胃虚寒、肠滑不固、血压偏低者、婚育期男士】慎食','芹菜'),
(DEFAULT,1,NULL,'健脑,抗衰老,美容,降血压,治肠道癌瘤','蛋白质,脂肪,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C','一般人群均可食用。尤适宜【孕妇、中老年人、过度劳累】者。','【皮肤瘙痒症、哮喘病、平素痰多、肠胃病】患者忌食','黄花菜'),
(DEFAULT,1,NULL,'健脾养脾,养胃健胃,养肾补肾,防癌抗癌,助发育','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒','花菜对【食欲不振、消化不良、大便燥结】者都有帮助；花菜适宜【生长发育】期的【儿童】、生活在污染环境中肝脏易遭到毒害的以及一切希望抵抗【癌症、肿瘤】染身的人们食用。','花菜没有特殊禁忌。','花菜'),
(DEFAULT,1,NULL,'健脾养脾,补气益气,消暑解暑,祛湿,清热','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,锌,碘,硒','一般人群均可食用。特别适宜【脾虚便溏、食欲不振、慢性久泄、妇女脾虚、带下、小儿疳积(单纯性消化不良)】者食用；适宜夏季【感冒挟湿、急性胃肠炎、消化不良、暑热口渴、心腹疼痛、食欲不振】之人服食；适宜【癌症】病人服食','患【寒热病】者,患【冷气、疟者、尿路结石】者忌食。','扁豆'),
(DEFAULT,1,NULL,'提高免疫力,通便,安神除烦,降糖消渴','蛋白质,脂肪,碳水化合物,膳食纤维,叶酸','一般人群均可食用。尤适宜【糖尿病、高血脂、低血糖】患者。','【痛风】患者忌食。','鸡腿菇'),
(DEFAULT,1,'1,4','降低血脂,肝脏排毒,防癌抗癌,润肠通便,强骨抗压,散血消肿','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,硒,','一般人均可食用。【便秘】患者与【老年人】更易食用','【目疾患者、小儿麻痹后期、狐臭等慢性病】患者慎食。','油菜'),
(DEFAULT,1,NULL,'提高免疫力,防癌抗癌,开胃消食,降血脂,降血压,抗衰老','蛋白质,碳水化合物,膳食纤维,烟酸,维生素C,钙,磷,钾,钠,镁,锌,硒','一般人群均可食用。更加适合【老年人】。','【脾胃寒湿、气滞、皮肤骚痒】病患者忌食','香菇'),
(DEFAULT,1,2,'清热解毒,增强体质,防止肌肉痉挛,促进生长发育','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,铁,锌,硒,锰,','一般人群均可食用。【老年人、小孩】食用效果更佳！','【阴盛阳虚体质、脾虚便溏、慢性腹泻】者忌食。','苋菜'),
(DEFAULT,1,2,'补气益气,调理肠胃,安神镇定,消暑解暑,降血脂,降血压','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。尤适宜【糖尿病、肾虚、尿频、遗精、妇科功能性疾病】患者。','气滞便结者慎食。','豇豆'),
(DEFAULT,1,NULL,'利水,消肿,降血压,消毒杀菌,消炎,治溃疡,治心脏病','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,钙,磷,铁','一般人群均可食用。尤适宜【肠胃道感染者、皮肤粗糙干燥、维生素A缺乏症、角膜软化症,眼干燥症,夜盲症者,小儿单纯性腹泻、小儿百日咳者、钩虫病患者、妇女赤白带下、孕妇临产、矽肺】患者','凡【脾胃索虚,腹泻便溏】之人忌食；【孕妇】尤其是有【习惯性流产】的孕妇忌食。','马齿苋'),
(DEFAULT,1,4,'防秋燥,抗癌,预防心脏病,促进胃肠蠕动','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,铁,锌,硒,锰','一般人群均可食用。【胆固醇高、心脏病】的患者易食用。','【阳痿】患者忌食。','芥蓝'),
(DEFAULT,1,1,'养胃健胃,养肾补肾,养肝护肝','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。尤适宜【便秘、产后乳汁不足女性、寒性体质】等人群。','【阴虚火旺、有眼疾、胃肠虚弱】的人不宜多食。','韭菜'),
(DEFAULT,1,2,'消脂减肥,镇痛催眠,驱寒利尿,抑制病毒','维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,硒,','一般人群均可食用。尤适宜【失眠、胆固醇高、神经衰弱】的人。','【尿频、胃寒】的人慎食','生菜'),
(DEFAULT,1,NULL,'防癌,抗癌,养颜,减肥','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁','一般人群均可食用。尤适宜【糖尿病、水肿腹胀】患者。','【脾胃虚寒】的人慎食。','西葫芦'),
(DEFAULT,1,2,'清热益气,保护机体,抗癌,降血糖,降血脂,美容护肤','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁','一般人群均可食用。【糖尿病、癌症】患者适宜。','【孕妇、脾胃虚寒】者慎食。','苦瓜'),
(DEFAULT,1,NULL,'养肝护肝,增强记忆力,排毒解毒,清热','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁','一般人群均可食用,特别适合【老人、儿童、消化力弱】的人食用莼菜。','【脾胃虚寒】的人不宜多食莼菜；妇女【月经期、产妇】应少食莼菜。','莼菜'),
(DEFAULT,1,NULL,'减肥,防动脉硬化,治心脑血管疾病,降低胆固醇,提高免疫力,防肿瘤,抗癌','碳水化合物,食纤维,烟酸,维生素A,钙,钾,钠,镁,铁,锌,硒','一般人群均可食用。尤其是【糖尿病、肥胖】患者的理想食品。','有【皮肤病】的病的人慎食。','魔芋'),
(DEFAULT,1,1,'养胃健胃,补血养血,补气益气,调理肠胃,增强记忆力,防癌抗癌,降血脂,降血糖,消脂吸脂,抗衰老','蛋白质,热量,脂肪,碳水化合物,膳食纤维,烟酸,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁','一般人群均可食用辣椒。【胃肠胀气、消化不良】患者更易食用。','【甲亢、肾炎、慢性气管炎、高血压、胃及十二指肠溃疡、急性胃炎、肺结核、痔疮、眼部疾病】患者忌食。','辣椒'),
(DEFAULT,1,3,'防癌抗癌,排毒解毒,驱寒','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。【脑力劳动者】更适宜。（过多食用葱会损伤视力。）','【眼疾患者、胃肠道疾病特别是溃疡病】的人,【表虚、多汗】者忌食。有【腋臭】的人在夏季应慎食。','大葱'),
(DEFAULT,1,4,'减肥,有助发育','蛋白质,碳水化合物,膳食纤维,烟酸,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁','般人群均可食用油麦菜。特别是【高胆固醇】患者。','【胃炎、泌尿系统疾病、身体虚寒、尿频、胃寒】的人慎食。','油麦菜');

