
/* ======================食材模块====================== */
/* 1.食材季节 */
USE tegin_hp;
DELETE FROM hp_foods_season;
INSERT INTO hp_foods_season VALUES(DEFAULT,'春季'),(DEFAULT,'夏季'),(DEFAULT,'秋季'),(DEFAULT,'冬季');

/* 2.食材类型
蔬菜类
水果/干果
禽畜/肉类
水产/海鲜
米面豆乳
药食/药材
蛋奶/其它
调味品*/
USE tegin_hp;
DELETE FROM hp_foods_type;
INSERT INTO  hp_foods_type VALUES
(DEFAULT,'蔬菜类',NULL),
(DEFAULT,'水果/干果',NULL),
(DEFAULT,'禽畜/肉类',NULL),
(DEFAULT,'水产/海鲜',NULL),
(DEFAULT,'米面/豆乳',NULL),
(DEFAULT,'药食/药材',NULL),
(DEFAULT,'蛋奶/其它',NULL),
(DEFAULT,'调味品',NULL);

/* 3.食材详情表  【添加一些主表id时 首先保证主表有对应数据并且找到对应的id再添加，不能随意添加引用的id】
 急需补充！！！！！！！*/
USE tegin_hp;
INSERT INTO hp_foods(fid,ftype_id, fseason_id,fefficiency_desc,fnutrient_name,fcrowd_desc,fno_crowd_desc,f_name)
VALUES
(DEFAULT,1,'1,2,4','杀菌,促消化,降压降脂,补钙,防癌抗癌,延缓衰老','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,铁,碘,硒','一般人群均可食用。尤适宜【高血压、动脉硬化】等【心血管疾病】患者。','【皮肤瘙痒】性疾病、【眼疾、胃病】患者慎食。','洋葱'),
(DEFAULT,1,'3,4','健脾开胃,清热解毒,降气止咳,降血糖,降血脂,补肝明目,美容护肤','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人皆可食用。尤以【癌症、高血压、夜盲症、干眼症、营养不良、皮肤粗糙】者为最。','【饮酒过量】者不宜食用','胡萝卜'),
(DEFAULT,1,NULL,'促进智力发育,新陈代谢,降血脂,抗疲劳,防过敏','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,磷,钾,钠,镁,铁','一般人群均可食用。适合【气血不足、营养不良的老人、儿童、癌症患者、肝脏病、胃肠道溃疡、心脑血管疾病】患者食用。','【脾胃虚寒、慢性腹泻、关节炎、红斑狼疮】患者慎食。','金针菇'),
(DEFAULT,1,'2,3','抗菌消炎,利尿,防癌,抗衰老,治疗牙龈出血,缓解眼疲劳','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,磷,钾,钠,镁,铁','一般人群均可食用。尤适宜于【热性病发热、口渴、食欲不振、习惯性牙龈出血、贫血、头晕、心悸、高血压、急慢性肝炎、急慢性肾炎、夜盲症、近视眼】者食用；','【急性肠炎、菌痢、溃疡活动期】病人不宜食用。','西红柿'),
(DEFAULT,1,NULL,'健脾养脾,养胃健胃,养肾补肾,防癌抗癌,助发育','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒','花菜对【食欲不振、消化不良、大便燥结】者都有帮助；花菜适宜【生长发育】期的【儿童】、生活在污染环境中肝脏易遭到毒害的以及一切希望抵抗【癌症、肿瘤】染身的人们食用。','花菜没有特殊禁忌。','花菜'),
(DEFAULT,1,NULL,'有助消化,增强食欲,化痰清热,宽中下气,降血脂,降血压等','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,硒','一般人均可食用,尤其适宜消化不良、食欲不振等人群。','【脾胃虚寒、寒性体质】的人群不宜常吃；【胃溃疡、十二指肠溃疡、慢性胃炎、单纯甲状腺肿、先兆流产、子宫脱垂】等患者需忌吃。','白萝卜'),
(DEFAULT,1,'2,3','抗肿瘤,抗衰老,防酒精中毒,降血糖,减肥强体,健脑安神','蛋白质,碳水化合物,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,','一般人群均可食用。尤适宜【热病、肥胖、高血压、高血脂、水肿、癌症、嗜酒者、糖尿病】患者食用。','【脾胃虚弱、腹痛腹泻、肺寒咳嗽、肝病、心血管病、肠胃病】患者慎食。','黄瓜') ,
(DEFAULT,1,3,'有助消化,增强食欲,化痰清热,宽中下气,降血脂,降血压等','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。【脑力劳动者】更适宜。（过多食用葱会损伤视力。）','【眼疾患者、胃肠道疾病特别是溃疡病】的人,【表虚、多汗】者忌食。有【腋臭】的人在夏季应慎食。','大葱') ,
(DEFAULT,1,'2,3','开通疏利,消积下气,利尿通乳,强壮机体,防癌抗癌,宽肠通便','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,胆碱,钙,磷,钾,钠,镁,铁,硒','一般人均可食用。尤适宜【婴幼儿、乳母】。','【视力弱者、眼疾、夜盲症】患者忌食。','莴笋') ,
(DEFAULT,1,2,'消脂减肥,镇痛催眠,驱寒利尿,抑制病毒','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,叶酸,水,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。尤适宜【失眠、胆固醇高、神经衰弱】的人。','【尿频、胃寒】的人慎食。','生菜') ,
(DEFAULT,1,2,'健脾养胃,护肝补肾,消炎止痛,润肺益气,驱虫解毒','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁','一般人均可食用,尤其适合【脾虚弱、营养不良、肺痈、支气管哮喘、老年慢性支气管炎、糖尿病、前列腺炎、水火烫伤】等患者食用。','南瓜性温,【胃热、温热气滞】的人少吃南瓜,同时有【脚气、黄痘、气滞湿阻】病的人最好也不要食用,另外患有感染性疾病和【发热】症状者不宜食用。','南瓜')，
(DEFAULT,1,'3,4','通利肠胃,清热解毒,止咳化痰,利尿养胃,促进生长发育','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钠,镁,铁','一般人均可食用,尤其适合【感冒发热、肺热咳嗽、便秘、咽喉发炎】者。','大白菜性寒,【胃寒腹痛、大便溏泻、寒痢疾】者不可多食。','白菜'),
(DEFAULT,1,NULL,'和胃活血,消肿等功效,可辅助治疗消化不良,习惯性便秘,神经乏力','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,叶酸,钙,磷,钾,钠,镁,铁,硒','一般人群均可,尤其适合【胃病、心脏病】患者食用。','处于【妊娠早期】的妇女【胃肠消化功能低下】者不宜食用。','土豆'),
(DEFAULT,1,NULL,'补中益气,益胃宽肠,解毒通便,消肿止痛','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,叶酸,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用,尤其适合【体虚】者','对于有痰、敏性体质【荨麻疹、湿疹、哮喘、过敏性鼻炎】者、【小儿食滞、胃纳欠佳、糖尿病】患者应少食；【食滞胃痛、肠胃湿热】者忌食。','芋头'),
(DEFAULT,1,NULL,'防癌抗癌,减肥瘦身,防动脉硬化','热量,钙,磷,钾,钠,铁,锌,硒,锰','一般人均可使用,尤其适合经常被【便秘】困扰的人。','【腹泻、糖尿病人】不宜吃红薯,有【胃病】的患者也要少吃。','红薯'),
(DEFAULT,1,2,'润肤美白,健脑,活血通络,解毒消肿','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,叶酸,水,钙,磷,钾,钠,镁,硒','一般人群均可食用。尤适宜【月经不调、身体疲乏、痰喘咳嗽、产后乳汁不通】的妇女。','【孕妇、体虚内寒、腹泻】者慎食。','丝瓜'),
(DEFAULT,1,NULL,'排毒养颜,美容祛斑','蛋白质,热量,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,锌,硒','【老幼妇孺、体弱多病】者尤宜,特别适宜【高热病人、吐血者、高血压、肝病、食欲不振、缺铁性贫血、营养不良】者多食用','藕性偏凉,【产妇】不宜过早食用。','莲藕'),
(DEFAULT,1,NULL,'增强免疫力,调理疾病,舒筋活血,延年益寿,促进大脑发育','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用。【体弱、更年期妇女、肝炎、消化系统疾病】人群,【软骨病、心血管疾病、尿道结石症、癌症】患者尤其适宜。','食用【菌类过敏】者忌食。','平菇'),
(DEFAULT,1,NULL,'解毒消肿,开胃消食,温中,利气','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,钙,磷,钾,钠,镁,铁,锌,硒,铜','一般人均可食用,老年人宜多食。','雪里红含大量粗纤维,不易消化,小儿【消化功能不全】者不宜多食。','
雪里蕻'),
(DEFAULT,1,NULL,'补气血,减肥,防癌,治便秘,清肠胃','蛋白质,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,钠,镁,铁,硒','一般人群均可食用。尤适宜【心脑血管疾病、结石症】患者食用,特别适合【缺铁】的人士、矿工、冶金工人、纺织工、理发师食用。','有【出血性疾病、腹泻者、孕妇】慎食。','木耳菜'),
(DEFAULT,1,NULL,'清热解毒,利湿,滑肠,补脾益气','蛋白质,碳水化合物,膳食纤维,胡萝卜素,维生素A,维生素C,维生素E,钙,磷,钾,镁,铁,锌','一般人群均可食用,尤适宜【湿疹、肠风热毒】者','【脾胃虚寒、阳虚体质】者慎食；常人也不宜多食。','蕨菜'),
(DEFAULT,1,NULL,'防癌抗癌,增强免疫力,促生长,减肥,清热解渴,抗衰老,护心养心','蛋白质,脂肪,碳水化合物,膳食纤维,烟酸,胡萝卜素,维生素A,维生素C,维生素E,叶酸,钙,磷,钾,钠,镁,铁,锌,硒','一般人群均可食用,【免疫力低下】者宜多食。','【红斑狼疮】患者忌食','西兰花'),